---
permalink: snaplock/set-retention-period-task.html 
sidebar: sidebar 
keywords: snaplock, set, retention, time, default, explicit, file, modify, volume, period 
summary: 您可以明确设置文件的保留时间，也可以使用卷的默认保留期限来派生保留时间。除非明确设置保留时间，否则 SnapLock 将使用默认保留期限来计算保留时间。 
---
= 设置保留时间
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
您可以明确设置文件的保留时间，也可以使用卷的默认保留期限来派生保留时间。除非明确设置保留时间，否则 SnapLock 将使用默认保留期限来计算保留时间。

.关于保留期限和保留时间
WORM 文件的 _retention period_ 用于指定文件提交到 WORM 状态后必须保留的时间长度。WORM 文件的 _retention time_ 是指文件不再需要保留的时间。例如，对于在 2020 年 11 月 10 日早上 6 ： 00 提交到 WORM 状态的文件，保留期限为 20 年将使保留时间为 2040 年 11 月 10 日早上 6 ： 00

image::../media/retention.gif[retention]

[NOTE]
====
从 ONTAP 9.10.1 开始，您可以将保留时间设置为 3058 年 10 月 26 日之前的保留时间，并将保留期限设置为 100 年之前的保留期限。延长保留日期后，较早的策略将自动转换。在 ONTAP 9.9.1 及更早版本中，除非将默认保留期限设置为无限，否则支持的最大保留时间为 2071 年 1 月 19 日（ GMT ）。

====
.重要的复制注意事项
在使用2071年1月19日(GMT)之后的保留日期与SnapLock 源卷建立SnapMirror关系时、目标集群必须运行ONTAP 9.10.1或更高版本、否则SnapMirror传输将失败。

.重要的还原注意事项
如果存在保留期限晚于 2071 年 1 月 19 日上午 8 ： 44 ： 07 的任何文件，则 ONTAP 会阻止您将集群从 ONTAP 9.10.1 还原到早期的 ONTAP 版本。

.了解默认保留期限
SnapLock Compliance 或 Enterprise 卷具有四个保留期限：

* 最短保留期限（ `m以` 为单位），默认值为 0
* 最长保留期限（ `max` ），默认为 30 年
* 默认保留期限，从 ONTAP 9.10.1 开始，合规模式和企业模式的默认保留期限均等于 `min` 。在 ONTAP 9.10.1 之前的 ONTAP 版本中，默认保留期限取决于模式：
+
** 对于合规模式，默认值等于 `max` 。
** 对于企业模式，默认值等于` 中的 `m。


* 未指定保留期限。
+
从 ONTAP 9.8 开始，您可以将卷中文件的保留期限设置为 `unspecified` ，以便在设置绝对保留时间之前保留该文件。您可以将绝对保留时间设置为未指定的保留时间的文件，并将其恢复为绝对保留时间，前提是新的绝对保留时间晚于先前设置的绝对时间。

+
从ONTAP 9.12.1开始、保留期限设置为的WORM文件 `unspecified` 保证将保留期限设置为为为SnapLock 卷配置的最小保留期限。将文件保留期限更改为 `unspecified` 要达到绝对保留时间、指定的新保留时间必须大于文件上已设置的最小保留时间。



因此，如果在将 Compliance 模式文件提交到 WORM 状态之前未明确设置保留时间，并且未修改默认值，则此文件将保留 30 年。同样，如果在将企业模式文件提交到 WORM 状态之前未明确设置保留时间，并且未修改默认值，则此文件将保留 0 年，或者实际上根本不保留。



== 设置默认保留期限

您可以使用 `volume SnapLock modify` 命令为 SnapLock 卷上的文件设置默认保留期限。

.您需要的内容
SnapLock 卷必须处于联机状态。

.关于此任务
下表显示了默认保留期限选项的可能值：

[NOTE]
====
默认保留期限必须大于或等于（ >= ）最短保留期限，且小于或等于（ \<= ）最长保留期限。

====
|===
| 价值 | Unit | 注释： 


 a| 
0 - 65535
 a| 
秒
 a| 



 a| 
0 - 24
 a| 
hours
 a| 



 a| 
0 - 365
 a| 
days
 a| 



 a| 
0 - 12
 a| 
months
 a| 



 a| 
0 - 100
 a| 
年
 a| 
从ONTAP 9.10.1开始。对于早期的ONTAP 版本、此值为0 - 70。



 a| 
最大
 a| 
-
 a| 
请使用最长保留期限。



 a| 
最小
 a| 
-
 a| 
请使用最短保留期限。



 a| 
无限
 a| 
-
 a| 
永久保留文件。



 a| 
未指定
 a| 
-
 a| 
保留这些文件，直到设置了绝对保留期限为止。

|===
最大和最小保留期限的值和范围是相同的，但 `max` 和` in `m除外，这两种情况不适用。有关此任务的详细信息，请参见 link:set-retention-period-task.html["设置保留时间概述"]。

您可以使用 `volume SnapLock show` 命令查看卷的保留期限设置。有关详细信息，请参见命令的手册页。

[NOTE]
====
将文件提交到 WORM 状态后，您可以延长但不能缩短保留期限。

====
.步骤
. 为 SnapLock 卷上的文件设置默认保留期限：
+
` * volume SnapLock modify -vserver _svm_name_ -volume _volume_name_ -default-retention-period _default_retention_period_ -minimal-retention-period _min_retention_period_ -max-retention-period _max_retention_period_*`

+
有关完整的选项列表，请参见命令手册页。

+
[NOTE]
====
以下示例假设先前未修改最短和最长保留期限。

====
+
以下命令会将 Compliance 或 Enterprise 卷的默认保留期限设置为 20 天：

+
[listing]
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period 20days
----
+
以下命令会将 Compliance 卷的默认保留期限设置为 70 年：

+
[listing]
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -maximum-retention-period 70years
----
+
以下命令会将 Enterprise 卷的默认保留期限设置为 10 年：

+
[listing]
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period max -maximum-retention-period 10years
----
+
以下命令会将 Enterprise 卷的默认保留期限设置为 10 天：

+
[listing]
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -minimum-retention-period 10days
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period min
----
+
以下命令会将 Compliance 卷的默认保留期限设置为无限：

+
[listing]
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period infinite -maximum-retention-period infinite
----




== 明确设置文件的保留时间

您可以通过修改文件的上次访问时间来明确设置文件的保留时间。您可以通过 NFS 或 CIFS 使用任何合适的命令或程序来修改上次访问时间。

.关于此任务
将文件提交到 WORM 后，您可以延长但不能缩短保留时间。保留时间存储在文件的 `atime` 字段中。

[NOTE]
====
您不能将文件的保留时间显式设置为 `无限` 。只有在使用默认保留期限计算保留时间时，此值才可用。

====
.步骤
. 使用合适的命令或程序修改要设置保留时间的文件的上次访问时间。
+
在 UNIX Shell 中，使用以下命令将保留时间设置为 2020 年 11 月 21 日早上 6 ： 00在名为 `document.txt` 的文件上：

+
[listing]
----
touch -a -t 202011210600 document.txt
----
+
[NOTE]
====
您可以使用任何合适的命令或程序来修改 Windows 中的上次访问时间。

====

